{
  "done": [
    {
      "name": "Spotify",
      "value": 1,
      "desc": "Simple Spotify app clone with some extra features",
      "link": "spotify",
      "url": "",
      "video": "spotify_app_overview",
      "github": "",
      "img": "",
      "role": "Product designer, backend",
      "team": ["name", "test"],
      "timeline": "01-04-2023 / 15-04-2023",
      "overview": "Il progetto nasce da un corso Universitario per il quale era necessario realizzare un'applicazione a piacere. Avendo sempre voluto realizzare un'app in ambito musicale ho deciso di effettuare un clone di Spotify.",
      "details": "L’applicazione è stata realizzata principalmente per permettere a chiunque di accedere al servizio in modo gratuito. Dunque non c’è una schermata iniziale di login ma si accede direttamente alla dashboard dell’applicativo. Il menu laterale permette di navigare nelle varie pagine mentre l’interno dell’app è composto principalmente da raccolte di canzoni suddivise per varie sezioni e categorie",
      "mainFeature": [
        {
          "name": "Search song",
          "img": "spotify/spotify_search",
          "desc": "Il sistema permette un servizio di ricerca delel canzoni, artisti, album con ricerche correlate.",
          "descFeature": []
        },

        {
          "name": "Home",
          "img": "spotify/spotify_home",
          "desc": "In questa sezione l'utente si ritroverà nella HomePage dell'app all'interno delal quale potrà effettuare una vera propria 'Discovery' delle traccie in primo piano.",
          "descFeature": []
        },
        {
          "name": "Library",
          "img": "spotify/spotify_playlist",
          "desc": "Una volta effettuato l'accesso sarà poi possibile visualizzare la propria libreria spotify. Manca ancora da integrare il cambio api da quelle di Rapid Api a quelle di Spotify per l'ascolto della musica.",
          "descFeature": []
        },
        {
          "name": "Track",
          "img": "spotify/spotify_track",
          "desc": "Questa pagina permette di ascoltare una canzone di un determinato artista, utilizzando un api limitata è possibile ascoltare solo parte della traccia.",
          "descFeature": []
        }
      ],
      "gridFeature": [],
      "feature": [
        {
          "name": "Login",
          "img": "",
          "desc": "Il login è possibile effettuarlo solo ed esclusivamente se si è in possesso di un account premium spotify. In questo modo sarà possibile utilizzare le api rese disponibili dal servizio."
        },

        {
          "name": "Design",
          "img": "",
          "desc": "Il design simile, ma allo stesso tempo innovativo in quanto cerca di aggiungere ciò che manca al servizio.",
          "descFeature": []
        }
      ],
      "technology": [
        {
          "name": "Authentication calls",
          "desc": "L'autenticazione è stata realizzata utilizzando il token di accesso disponibile nella pagina sviluppatore di spotify. Successivamente è stato utilizzato un altro token per RapidApi per recuperare l'mp3 relativo alle canzoni cercate."
        },
        {
          "name": "Client",
          "desc": "L'interfaccia utente è stataprogettata e realizzata in ReactJs."
        },
        {
          "name": "Design",
          "desc": "The entire application was made with vanilla css style following the original Spotify design and palette."
        }
      ]
    },
    {
      "name": "Yoxeen",
      "value": 1,
      "desc": "Sistema di supporto all'allenamento in palestra, con funzionalità di creazione di schede d'allenamento e dieta.",
      "link": "yoxeen",
      "url": "https:yoxeen.it",
      "github": "",
      "img": "",
      "role": "Product designer, backend",
      "team": ["name", "test"],
      "timeline": "01-04-2021 / 08-07-2022",
      "overview": "Il progetto è nato per permettere a chiunque di avere la possibilità di creare la propria scheda di allenamento in quanto durante la prima fase di progettazione avevo notato che non c'erano ancora applicazioni che permettessero di svolgere questa funzionalità in modo gratuito.",
      "details": "Il sistema permette di effettuare l'accesso e salvare i propri progressi recuperando statistica sull'allenamento, salvando la propria routine e tenere sotto controllo i dati giornalieri derivanti dai sensori.",
      "mainFeature": [
        {
          "name": "Workout builder",
          "img": "",
          "video": "yoxeen_workout",
          "desc": "In questa sezione è possibile accedere all'interno dell'app come profilo utente o allenatore. Sarà necessario compilare il form di registrazione per poter eseguire correttamente l'accesso.",
          "descList": [
            "Creazione scheda di allenamento",
            "Modifica",
            "Salvataggio",
            "Esportazione in pdf",
            "Condivisione con un altro utente"
          ],
          "descFeature": []
        },

        {
          "name": "Diet Build",
          "img": "",
          "video": "yoxeen_diet",
          "desc": "In questa sezione dell'applicazione si può creare una scheda alimentare personalizzata. La ricerca degli alimenti può avvenire in 5 lingue e il risultato sarà salvato nella lingua originale impostata nel profilo. Il numero di alimenti presenti all'interno del database è basilare ed è mirato ad un'alimentazione sana della persona. In caso di mancanze o necessità vi prego di segnalare all'interno della sezione contatti.",
          "descList": [
            "Creazione scheda alimentare",
            "Modifica",
            "Esportazione in pdf"
          ],
          "descFeature": []
        },
        {
          "name": "Multilanguage",
          "img": "https://source.unsplash.com/random",
          "desc": "Questa funzionalità permette all'utente di scegliere la propria lingua. Non è del tutto implementato ma a livello di esercizi da inserire nella scheda e la personalizzazione della propria dieta possono essere fatte in diverse lingue.",
          "descFeature": []
        },
        {
          "name": "Statistiche",
          "img": "https://source.unsplash.com/random",
          "desc": "All'interno dell'app sarà possibile tenere traccia di tutti i dati e successivamente guardare le statistiche generate.",
          "descList": [],
          "descFeature": [
            {
              "name": "Macro Chart",
              "img": "yoxeen/yoxeen_progress_macro"
            },
            {
              "name": "Weight chart",
              "img": "yoxeen/yoxeen_progress_weight"
            },
            {
              "name": "Workout chart",
              "img": "yoxeen/yoxeen_progress_workout_stats"
            },
            {
              "name": "Google Fit Daily data",
              "img": "yoxeen/yoxeen_progress_google_fit"
            }
          ]
        },
        {
          "name": "Explore",
          "img": "",
          "desc": "Nel caso avessi la necessità di trovare un personal trainer nella tuo zona sarà possibile effettuarlo andando nella sezione apposita e cercando semplicemente la città. Nel caso in cui non dovessero esserci pt saranno visualizzati i più vicini entro un raggio di 50km.",
          "descFeature": [
            {
              "name": "Home",
              "img": "yoxeen/yoxeen_explore_home"
            },
            {
              "name": "Category",
              "img": "yoxeen/yoxeen_explore_category"
            },
            {
              "name": "Exercises list",
              "img": "yoxeen/yoxeen_explore_exercises_list"
            },
            {
              "name": "Exercise",
              "img": "yoxeen/yoxeen_explore_exercise"
            }
          ]
        },
        {
          "name": "Find PT",
          "img": "yoxeen/yoxeen_find_expert",
          "desc": "Nel caso avessi la necessità di trovare un personal trainer nella tuo zona sarà possibile effettuarlo andando nella sezione apposita e cercando semplicemente la città. Nel caso in cui non dovessero esserci pt saranno visualizzati i più vicini entro un raggio di 50km.",
          "descFeature": []
        }
      ],
      "feature": [
        {
          "name": "Login",
          "img": "https://source.unsplash.com/random",
          "desc": "La parte di login è stata implementata attraverso l'utilizzo di Firebase e JWT token e permette ad un utente generico di accedere e avere un account su cui salvarsi tutti i progressi."
        },
        {
          "name": "Multilanguage",
          "img": "yoxeen/yoxeen_multi_language",
          "desc": "Questa funzionalità permette all'utente di scegliere la propria lingua. Non è del tutto implementato ma a livello di esercizi da inserire nella scheda e la personalizzazione della propria dieta possono essere fatte in diverse lingue.",
          "descFeature": []
        },
        {
          "name": "Free",
          "img": "https://source.unsplash.com/random",
          "desc": "L'app è stata progettata per essere gratuita a tutti coloro che hanno la necessità di iniziare l'approccio all'interno del mondo del fitness. Per qualsiasi idea di miglioramente o qualche feature da inserire vi prego di segnalarlo al seguente link.",
          "link": "Link di segnalazione",
          "descFeature": []
        }
      ],
      "technology": [
        {
          "name": "Authentication",
          "desc": "Per la parte relativa all'autenticazione è stato utilizzato Firebase per la gestione delle credenziali di accesso e dello stacco dello user Id. Successivamente lato server viene generato il Jwt token passato al client."
        },
        {
          "name": "Database",
          "desc": "MongoDB è il principale db utilizzato per il savlataggio dei dati. Le scelte su questo database sono state per la sua scalabilità e gestione di grandi quantità di dati."
        },
        {
          "name": "Client",
          "desc": "L'interfaccia utente è stataprogettata e realizzata in ReactJs."
        },
        {
          "name": "Backend",
          "desc": "Il sistema è stato sviluppato attraverso NodeJs."
        },
        {
          "name": "Design",
          "desc": "The entire application was made following the Material Design tips using Material UI js library in addition to vanilla css style."
        }
      ],
      "demo": "link to demo video",
      "future_develop": "L'app è stata pensata per essere un servizio gratuito per la gestione dell'allenamento."
    },
    {
      "name": "Disco",
      "value": 7,
      "desc": "Sistema di gestione degli eventi nel locale",
      "link": "disco",
      "github": "",
      "img": "",
      "role": "Product designer, backend",
      "team": ["name", "test"],
      "timeline": "01-04-2021 / 08-07-2022",
      "overview": "Il progetto nasce con l'idea di creare un servizio per locali notturni prenotazioni. Statistiche, ingressi, omaggi, liste sono solo alcuni dei concetti che vengono riportati nel sistema che vengono utilizzati ogni serata da tutte le discoteche. L'applicazione permette di semplificare il tutto e tenere sotto controllo il proprio locale.",
      "details": "L’applicazione è stata realizzata principalmente per permettere a chiunque di accedere al servizio in modo gratuito. Dunque non c’è una schermata iniziale di login ma si accede direttamente alla dashboard dell’applicativo. Il menu laterale permette di navigare nelle varie pagine mentre l’interno dell’app è composto principalmente da raccolte di canzoni suddivise per varie sezioni e categorie",
      "mainFeature": [],
      "feature": [
        {
          "name": "Login",
          "img": "https://source.unsplash.com/random",
          "desc": "Login di un utente amministratore di un locale"
        },
        {
          "name": "Dashboard",
          "img": "yoxeen/yoxeen_multi_language",
          "desc": "Schermata principale dell'amministratore che può gestire le prenotazioni",
          "descFeature": []
        },
        {
          "name": "Booking",
          "img": "https://source.unsplash.com/random",
          "desc": "Prenotazione da parte di una persona ad una serata specifica. La prenotaizone può avvenire tramite lista, tavolo o attraverso un pr del locale. La prenotazione può essere cancellata o modificata.",
          "descFeature": []
        },
        {
          "name": "Stats",
          "img": "https://source.unsplash.com/random",
          "desc": "All'interno della dashboard è possibile vedere un resoconto delle statistiche di ogni serata e dell'insieme delle serate. Inoltre, per queste informazioni, è stato implementato un meccanismo di invio email al termine di un evento.",
          "descFeature": []
        },
        {
          "name": "Pdf",
          "img": "https://source.unsplash.com/random",
          "desc": "Ogni amministratore può salvare le sue ordinazioni, i ssuoi tavoli e tutto il resto, all'intenro di un file pdf. In questo modo si rende l'interno sistema digitalizzato.",
          "descFeature": []
        },
        {
          "name": "Bot Telegram",
          "img": "https://source.unsplash.com/random",
          "desc": "Un amministratore di un locale solitamente si avvale di pr per effettuare o gestire una prenotazione. Per questo motivo, per questo ruolo è stato creato un bot telegram, che dopo la registrazione da parte del pr e l'approvazione da parte dell'amministratore, può iniziare ad operare.",
          "descFeature": []
        },
        {
          "name": "Multi-club",
          "img": "https://source.unsplash.com/random",
          "desc": "Un amministratore può essere anche il proprietario, oppure può far parte di più locali. Per questo motivo c'è la possibilità di modificare la propria lista dei locali con l'aggiunta di uno nuovo.",
          "descFeature": []
        }
      ],
      "technology": [
        {
          "name": "Authentication",
          "desc": "Per la parte relativa all'autenticazione è stato utilizzato Firebase per la gestione delle credenziali di accesso e dello stacco dello user Id. Successivamente lato server viene generato il Jwt token passato al client."
        },
        {
          "name": "Database",
          "desc": "MySQL è il principale db utilizzato per il savlataggio dei dati. Le scelte su questo database sono state per la sua chiara organizzazione delle informazioni."
        },
        {
          "name": "Client",
          "desc": "L'interfaccia utente è stataprogettata e realizzata in ReactJs."
        },
        {
          "name": "Backend",
          "desc": "Il sistema è stato sviluppato attraverso NodeJs."
        },
        {
          "name": "Design",
          "desc": "The entire application was made following the Material Design tips using Material UI js library in addition to vanilla css style."
        }
      ],
      "future_develop": "In conclusione l’app non è stata pensata solamente per essere una copia del servizio originale di Spotify, quanto più come una nuova piattaforma che potesse migliorare le caratteristiche di quella attuale. Le funzionalità future che saranno implementate riguardano:• Includere una pagina relativa ai concerti di un particolare artista o semplicemente quelli in una città particolare • Implementare la radio in quanto ci sono dei canali con molti ascolti che sicuramente farebbe aumentare il tempo di utilizzo dell’applicazione • Sfruttare meglio l’API resa disponibile da Spotify in modo da utilizzare il token generato per più chiamate e quindi utilizzare meno la soluzione attuale con rapid-ap"
    },
    {
      "name": "University Bachelor Thesis",
      "value": 2,
      "desc": "Progetto di ricerca universitario che consiste nello sviluppare un algoritmo di routing adattato ai veicoli di micromobilità in modo da trovare il percorso più breve, sicuro e basati sulle preference di input dell'utente.",
      "link": "bachelor",
      "github": "",
      "img": "",
      "role": "Full stack developer",
      "team": ["me"],
      "timeline": "01-04-2023 / 28-09-2023",
      "overview": "Il progetto nasce come estensione di un sistema esistenza di monitoraggio della salute di un utente tramite smartwatch. Nello specifico è stato creato un modulo di monitoraggio alimentare che permette di tenere traccia dell'alimentazione seguita dal paziente. A questo è stato aggiunto un sistema di comunicazione e monitoraggio adattato al medico, che dunque avrebbe potuto controllare direttametne lo stato del paziente dalla sua app e se necessario notificarlo con un messagggio.",
      "details": "Nello specifico sono state sviluppate due applicazioni Android.",
      "mainFeature": [
        {
          "name": "ARCHITETTURA",
          "img": "lifezone/lifezone_architettura",
          "desc": "Questo rappresenta l'astrazione del sistema e di come ogni parte è stata integrata al fien di renderlo il più efficiente possibile.",
          "descFeature": []
        },
        {
          "name": "CLIENT_HOME",
          "img": "https://source.unsplash.com/random",
          "desc": "Questa pagina rappresenta il core del modulo della dietistica e al suo interno è possibile svolgere operazioni di aggiungita, rimozione e modifica di un alimento inserito. Inoltre, è presente un resoconto dei principali macronutrienti assunti durante la giornata.",
          "descFeature": [
            {
              "name": "home",
              "img": "lifezone/lifezone_home_diary"
            },
            {
              "name": "add meal screen",
              "img": "lifezone/lifezone_home_meal"
            },
            {
              "name": "water goal",
              "img": "lifezone/lifezone_home_water_goal"
            }
          ]
        },
        {
          "name": "CLIENT_ACTIVITY",
          "img": "https://source.unsplash.com/random",
          "desc": "In questa pagine il paziente può visualizzare i passi giornalieri e le notifiche ricevute da parte del proprio medico. Queste notifiche rappresentano messaggi che un medico uvuole riferire al proprio paziente, come ad esempio 'Bevi più acqua' o 'Ricordati di fare 5000 passi'. Dunque svolgono la funzione di 'Reminder'",
          "descFeature": [
            {
              "name": "activity_1",
              "img": "lifezone/lifezone_activity_1"
            },
            {
              "name": "activity_2",
              "img": "lifezone/lifezone_activity_2"
            },
            {
              "name": "activit message",
              "img": "lifezone/lifezone_activity_message"
            }
          ]
        },
        {
          "name": "CLIENT_COACH",
          "img": "https://source.unsplash.com/random",
          "desc": "In questa schermata un paziente può consultare degli articoli per migliorare la propria alimentazione. Essi sono raggruppati in varie cateogrie e sono stati appositamente preparati in modo da permetterne una facile lettura e categorizzazione.",
          "descFeature": [
            {
              "name": "coach",
              "img": "lifezone/lifezone_coach_1"
            },
            {
              "name": "coach detail",
              "img": "lifezone/lifezone_coach_2"
            }
          ]
        }
      ],
      "feature": [],
      "technology": [
        {
          "name": "Authentication",
          "desc": "Per la parte relativa all'autenticazione è stato utilizzato Firebase per la gestione delle credenziali di accesso e dello stacco dello user Id. Successivamente lato server viene generato il Jwt token passato al client."
        },
        {
          "name": "Database",
          "desc": "PostgreSql è il principale db utilizzato per il savlataggio dei dati. Le scelte su questo database sono state per la sua scalabilità e gestione di grandi quantità di dati."
        },
        {
          "name": "Client",
          "desc": "L'interfaccia utente è stataprogettata e realizzata in ReactJs."
        },
        {
          "name": "Backend",
          "desc": "Il sistema è stato sviluppato attraverso Java Springboot."
        },
        {
          "name": "Design",
          "desc": "The entire application was made following the Material Design tips using Material UI js library in addition to vanilla css style. The map is Leaflet."
        }
      ],
      "demo": "link to demo video",
      "future_develop": "L'app è stata pensata per essere un servizio gratuito per la gestione dell'allenamento."
    }
  ],
  "progress": [
    {
      "name": "University Master Thesis",
      "value": 2,
      "desc": "Progetto di ricerca universitario che consiste nello sviluppare un algoritmo di routing adattato ai veicoli di micromobilità in modo da trovare il percorso più breve, sicuro e basati sulle preference di input dell'utente.",
      "link": "master",
      "github": "",
      "img": "",
      "role": "Full stack developer",
      "team": ["me"],
      "timeline": "01-04-2023 / 28-09-2023",
      "overview": "Il progetto nasce con l'idea di permettere ad un utente di un mezzo di micromobilità di utilizzarlo nel modo più sicuro possibile. Difatti sono vari i problemi che circondano questa nuova tipologia di trasporto e la sicurezza per l'utente è un tema molto importate. Per questo motivo è stato sviluppato un algoritmo di routing basato principalmente sul peso dell'arco che tenesse conto di tutte le variabili che possono esserci durante il percorso.",
      "details": "Inizialmente il sistema era stato progettato per essere eseguito localmente, ma con successive riflessioni basate anche sugli sviluppi futuri la scelta di utilizzare un database e non la memoria del computer per la costrizione del grafo ha determinato gli sviluppi. Dunuqe il database scelta è stato PostgreSql con l'estensione di PostGis e per effettuare le interrogazioni si è sviluppato un'applicazione SpringBoot in Java. Il progetto si è poi evoluto con un interfaccia grafica sviluppata in ReactJs per la visualizzazione reale del percorso.",
      "mainFeature": [
        {
          "name": "Routing",
          "img": "https://source.unsplash.com/random",
          "desc": "La main feature del sistema si basa sulla ricerca del percorso ottimale più breve. Fino a questo punto l'algoritmo utilizzato si basa solo ed esclusivamente sulle strade urbane dell cità, comprendendo tutti i percorsi esistenti percorribili. Dunque non si tiene conto dei mezzi di trasporto come mezzo intermedio di spostamento.",
          "descFeature": []
        },
        {
          "name": "Form",
          "img": "https://source.unsplash.com/random",
          "desc": "In questa parte della pagina ritroviamo il componente relativo al form che permette all'utente di scegliere velocemente il mezzo di trasporto e i punti del percorso.",
          "descFeature": []
        },

        {
          "name": "Multi-path",
          "img": "https://source.unsplash.com/random",
          "desc": "Questa feture permette semplicemente di scegliere percorsi destinazioni multiple.",
          "descFeature": []
        },
        {
          "name": "Multilanguage",
          "img": "https://source.unsplash.com/random",
          "desc": "Questa funzionalità permette all'utente di scegliere la propria lingua. Non è del tutto implementato ma a livello di esercizi da inserire nella scheda e la personalizzazione della propria dieta possono essere fatte in diverse lingue.",
          "descFeature": []
        }
      ],
      "feature": [],
      "technology": [
        {
          "name": "Authentication",
          "desc": "Per la parte relativa all'autenticazione è stato utilizzato Firebase per la gestione delle credenziali di accesso e dello stacco dello user Id. Successivamente lato server viene generato il Jwt token passato al client."
        },
        {
          "name": "Database",
          "desc": "PostgreSql è il principale db utilizzato per il savlataggio dei dati. Le scelte su questo database sono state per la sua scalabilità e gestione di grandi quantità di dati."
        },
        {
          "name": "Client",
          "desc": "L'interfaccia utente è stataprogettata e realizzata in ReactJs."
        },
        {
          "name": "Backend",
          "desc": "Il sistema è stato sviluppato attraverso Java Springboot."
        },
        {
          "name": "Design",
          "desc": "The entire application was made following the Material Design tips using Material UI js library in addition to vanilla css style. The map is Leaflet."
        }
      ],
      "demo": "link to demo video",
      "future_develop": "L'app è stata pensata per essere un servizio gratuito per la gestione dell'allenamento."
    }
  ]
}
